app/views/articles/_comments.html.erb

		<div class="col-xs-6">
			<%= @article.comments.count %> comentario(s)
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 17]]