app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
	def index
		@articles = Article.paginate(page: params[:page], per_page: 10).publicados.ultimos

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 0], ["updated_at", "2015-07-19 19:38:08.884890"], ["id", 6]]
---
	def show
		@article.update_visits_count

SELECT "categories".* FROM "categories"
---
	def new
		@article = Article.new
		@categories = Category.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "El mejor articulo"], ["body", "the best article"], ["created_at", "2015-06-26 01:39:45.052026"], ["updated_at", "2015-06-26 01:39:45.052026"]]
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["article_id", 11], ["created_at", "2015-07-20 02:44:26.014833"], ["updated_at", "2015-07-20 02:44:26.014833"]]
---
	def create
		@article = current_user.articles.new(article_params)
		@article.categories = params[:categories]
		if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
---
	def destroy
		@article.destroy

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Primer articulo!"], ["updated_at", "2015-07-04 00:34:44.771492"], ["id", 1]]
---
	def update
		if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
---
		def set_article
			@article = Article.find(params[:id])